#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be created
  + resource "google_monitoring_notification_channel" "notification_channel" {
      + display_name        = "production"
      + enabled             = true
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + project             = (known after apply)
      + type                = "slack"
      + verification_status = (known after apply)
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[0] will be created
  + resource "google_project_iam_member" "api_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com"
      + project = "terra-datarepo-production"
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-app.vault_generic_secret.api_sa_key[0] will be created
  + resource "vault_generic_secret" "api_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-api-sa"
    }

  # module.datarepo-app.vault_generic_secret.sql_db_password[0] will be created
  + resource "vault_generic_secret" "sql_db_password" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-sql-db"
    }

  # module.datarepo-app.vault_generic_secret.sql_sa_key[0] will be created
  + resource "vault_generic_secret" "sql_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/datarepo-sql-sa"
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        additional_zones            = []
        cluster_ipv4_cidr           = "10.127.0.0/20"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "34.72.249.113"
        id                          = "projects/terra-datarepo-production/locations/us-central1/clusters/jade-master-us-central1"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/terra-datarepo-production/zones/us-central1-c/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-8f69ab46-grp",
            "https://www.googleapis.com/compute/beta/projects/terra-datarepo-production/zones/us-central1-f/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-aa4a504e-grp",
            "https://www.googleapis.com/compute/beta/projects/terra-datarepo-production/zones/us-central1-b/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-eb0a0b59-grp",
        ]
        label_fingerprint           = "a9dc16a7"
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.16.13-gke.401"
      ~ min_master_version          = "1.16.13-gke.1" -> "1.16.13-gke.401"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "jade-master-us-central1"
        network                     = "projects/terra-datarepo-production/global/networks/production-network"
        networking_mode             = "VPC_NATIVE"
        node_locations              = [
            "us-central1-b",
            "us-central1-c",
            "us-central1-f",
        ]
        node_version                = "1.16.13-gke.401"
        project                     = "terra-datarepo-production"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.0.16.0/20"
        subnetwork                  = "projects/terra-datarepo-production/regions/us-central1/subnetworks/production-subnet"

        addons_config {

            istio_config {
                disabled = true
            }

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            autoscaling_profile = "BALANCED"
            enabled             = false
        }

        cluster_telemetry {
            type = "ENABLED"
        }

        database_encryption {
            state = "DECRYPTED"
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.127.0.0/20"
            cluster_secondary_range_name  = "pods"
            services_ipv4_cidr_block      = "10.0.16.0/20"
            services_secondary_range_name = "services"
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lSQUsrN09uYWRLckNwNVJHS3ZtemtWQW93RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09EbGtZemc0WkRjdFpqbGlNeTAwT1RrekxUbGxNVGN0Tnpsak1EazVNakV6TVRoagpNQjRYRFRJd01EZ3lNREUzTVRJek5sb1hEVEkxTURneE9URTNNVEl6Tmxvd0VURVBNQTBHQTFVRUF4TUdZMnhwClpXNTBNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXJuS2RXNlVIZmFJdUNnV3AKdmdPOXI0Yk5SSUVFQytBdnZpVXhXWmdza2c0czlFRHN3REhoUFBwa1N3YXR0YjJoQUNtTFlFaVY0VWNGbFRnUgpVeEN1N21qQnBxRmtjdWU2cUQzTGtSV0tzcGtETFpMU3FUZDdacTNnUEpoby85NzFWam1NYVR6bW1GKzc2RnRLCi9BOFBNSC92NlprRDJIemxBVkgrRWgyMEFpRHBXQ25QSTByZ3B2b25YWS81by9WTG84NldFSGRPWXhjdzlVRUIKRG1ZRWRYZjh6ZmxiZGpsRHFPSkFJZ0lGNXQxZDA4NUJhQ3RPSjBYUEFMVnY3bU9pVi9wQ0JMdTdWT2I0dGJMWgoxRHZXS0Vad0VjZFhEQ1NIanlkQSt4MjlrdHZaaHROYk9lb2dWUnlmay9oZjNOanhZaU1NODF6em5zeHhvUXNoCm80ODZiUUlEQVFBQm96RXdMekFNQmdOVkhSTUJBZjhFQWpBQU1COEdBMVVkSXdRWU1CYUFGSnE2bU92VTJkZXcKU3JUYXVacDhqbWxQRFpzeE1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQnNPOVZzOWs4aHdPUEd0WUVMak1tSgpMWTNUL3BJMDdNMnBwZXNkS3pnbzZhbEVsck5jc05VMDBBZjZ1S01DSUUvQXFET2NpV3c3KytHVmo3aDNNajkzClZ3SUlMUjFYVDJTUXl2NkJ0QUtzOFl3TzFKOWc1dnhKZjkwaDQ3a3Axd2VTTW00cnBaYWhuMnFYTVlydlZRQ2QKUTVnMTB3RzRreFMxMEF5cUcrcUJmaFkxR2RKOWJrM1BKMXFCaWFNaXg4UzdxTjBlcG41Sk5ydVJ3czVqblJiZgo0ZUxrV0pEaVlaUWVpZW9TMjBVVlBWOXNxS1IyVEh5dkhTcEp1WWp0anpYRk11alN0ckJmWExjZE5rWXZhOXhnCndyOVk2ajJTZ01SVTVGUUFraHdTRHBaZ2o1cWRkNno0azlJZURsMVNuTGI3RittVTdnTVgzQi9ydklnclRDVlEKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURLakNDQWhLZ0F3SUJBZ0lRVUM4VXR1cm9Da0pTcmlmNFREKzQ1VEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNE9XUmpPRGhrTnkxbU9XSXpMVFE1T1RNdE9XVXhOeTAzT1dNd09Ua3lNVE14T0dNdwpIaGNOTWpBd09ESXdNVFl4TWpNMVdoY05NalV3T0RFNU1UY3hNak0xV2pBdk1TMHdLd1lEVlFRREV5UTRPV1JqCk9EaGtOeTFtT1dJekxUUTVPVE10T1dVeE55MDNPV013T1RreU1UTXhPR013Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUUNWSHo1Y3hDVEdXUVc1V1BlcWFhd0kzMWtXSUI1eUlySlJLK3FLaXZjMQpIbzdRMkx1ckxmVUFHYkZBSVNLb0xtbXVEcFkwMk41NXdKS1hwMGp2RmwzeEQ5MGZyUERQM0FOemdDelZoRnhiCmFzc1FiMWFya2ZuYlpJc0lCaFpDdjNNQ2hzY0tDeVFLMFpsR1R6ZlkrSThKYXIweVdzdC8rSEo2MHNFNFlaUkcKTm5GWGpPQjY4WlRwdHZYMm9wRlRtbjZYaDJjellocFl6cUtNeFM5bC9xeGFYMnJsKzVXT3NYblN2YmZMQXVvbQpQcGQvMURVMEVqa0RMMFZSQUlQMkw4NHB0dW0wdXFSa3kxNTZLQ3Z3RWcwMEJIM1NLQmYyMjJ5NHFseDE3cGkrClBCWW1ZbkZxVE5VTWdaRGZRZkxDQkdvanJNalB6RFZMOUk5MkpWbVlScXIvQWdNQkFBR2pRakJBTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTYXVwanIxTm5Yc0VxMAoycm1hZkk1cFR3MmJNVEFOQmdrcWhraUc5dzBCQVFzRkFBT0NBUUVBR29oVDZYVXZUVU1UTUM3S2ZXUkNFL3I3Cjk5NjVwZ3drTWhEM1RnaG84VThtckpHR3hWajNSU0c3bkZGSUdkeE1vVklJR3pPVEFBOW1tZDFSOFVtQ3N2UEEKYU9nZndIdlY3dS9VUitUQmdQY3dRVHg4WExBalNFWklUT3VjRVBkQ1dlb2RQRHZGaW9Ia3ZrcmZNMHVhMGN0SwpXMHBaQjY2Nzh2MXNjYjI0SmtXUVBWYjhaS21rc0Q1RHFyZ3M0TkZUZmIwaUI0Z01jSit0NVBkd20rc3o5TjZlCkh4R0FNMzdGQVZKbENPM3c5Wm01dzZXRTRBQVRhUHZNQUFZbUhCNnAreHJWUk1IR01vaVl6UmR2cnBDc3l2TWcKTEVWNTNmK24wSzFsMWlZOUpUR1dNQUJhU0Q4ZzZNNlgzZzMvYjZjaDNSZ1JnOHJqTVlnY1dhRjluVnlJZ2c9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="

            client_certificate_config {
                issue_client_certificate = true
            }
        }

        master_authorized_networks_config {
            cidr_blocks {
                cidr_block = "34.68.105.207/32"
            }
            cidr_blocks {
                cidr_block = "35.184.212.129/32"
            }
            cidr_blocks {
                cidr_block = "69.173.112.0/21"
            }
            cidr_blocks {
                cidr_block = "69.173.120.0/22"
            }
            cidr_blocks {
                cidr_block = "69.173.124.0/23"
            }
            cidr_blocks {
                cidr_block = "69.173.126.0/24"
            }
            cidr_blocks {
                cidr_block = "69.173.127.0/25"
            }
            cidr_blocks {
                cidr_block = "69.173.127.128/26"
            }
            cidr_blocks {
                cidr_block = "69.173.127.192/27"
            }
            cidr_blocks {
                cidr_block = "69.173.127.224/30"
            }
            cidr_blocks {
                cidr_block = "69.173.127.228/32"
            }
            cidr_blocks {
                cidr_block = "69.173.127.230/31"
            }
            cidr_blocks {
                cidr_block = "69.173.127.232/29"
            }
            cidr_blocks {
                cidr_block = "69.173.127.240/28"
            }
            cidr_blocks {
                cidr_block = "69.173.64.0/19"
            }
            cidr_blocks {
                cidr_block = "69.173.96.0/20"
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "environment" = "jade"
                "project"     = "terra-datarepo-production"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = [
                "terra-datarepo-production",
                "jade",
                "kubernetes",
            ]
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        node_pool {
            initial_node_count  = 2
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/terra-datarepo-production/zones/us-central1-c/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-8f69ab46-grp",
                "https://www.googleapis.com/compute/v1/projects/terra-datarepo-production/zones/us-central1-f/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-aa4a504e-grp",
                "https://www.googleapis.com/compute/v1/projects/terra-datarepo-production/zones/us-central1-b/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-eb0a0b59-grp",
            ]
            max_pods_per_node   = 110
            name                = "jade-node-us-central1"
            node_count          = 2
            node_locations      = [
                "us-central1-b",
                "us-central1-c",
                "us-central1-f",
            ]
            version             = "1.16.13-gke.401"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "environment" = "jade"
                    "project"     = "terra-datarepo-production"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = [
                    "terra-datarepo-production",
                    "jade",
                    "kubernetes",
                ]
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "GKE_METADATA_SERVER"
                }
            }

            upgrade_settings {
                max_surge       = 1
                max_unavailable = 0
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
            peering_name            = "gke-nf23a8a48e53b533c55a-9473-6d32-peer"
            private_endpoint        = "10.227.0.2"
            public_endpoint         = "34.72.249.113"
        }

        release_channel {
            channel = "REGULAR"
        }

        workload_identity_config {
            identity_namespace = "terra-datarepo-production.svc.id.goog"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts will be created
  + resource "google_monitoring_alert_policy" "node_resource_alerts" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-node-resource-usage"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-production"

      + conditions {
          + display_name = "node-cpu-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/cpu/allocatable_utilization\" resource.type=\"k8s_node\" "
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "node-memory-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/node/memory/allocatable_utilization\" resource.type=\"k8s_node\" metric.label.\"memory_type\"=\"non-evictable\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.labels.node_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A cluster node has been running with high resource utilization for greater than 300seconds"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert will be created
  + resource "google_monitoring_alert_policy" "pod_health_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-container-health-status"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-production"

      + conditions {
          + display_name = "container-frequent-restarts"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "600s"
              + filter          = "metric.type=\"kubernetes.io/container/restart_count\" resource.type=\"k8s_container\""
              + threshold_value = 0

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.container_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }

      + documentation {
          + content   = "A container has been experiencing frequent restarts for greater than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util will be created
  + resource "google_monitoring_alert_policy" "pod_memory_util" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "k8s-pod-resource-utilization"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-production"

      + conditions {
          + display_name = "pod-memory-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/memory/limit_utilization\" resource.type=\"k8s_container\" metric.label.\"memory_type\"=\"non-evictable\" resource.label.\"container_name\"!=\"metadata-proxy\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-volume-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/pod/volume/utilization\" resource.type=\"k8s_pod\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "metric.label.volume_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }
      + conditions {
          + display_name = "pod-cpu-limit-utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"kubernetes.io/container/cpu/limit_utilization\" resource.type=\"k8s_container\""
              + threshold_value = 0.95

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.labels.cluster_name",
                      + "resource.label.namespace_name",
                      + "resource.label.pod_name",
                      + "resource.label.container_name",
                    ]
                  + per_series_aligner   = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = "A pod has been requesting greater than 95% of a resource limit for longer than 5 minutes"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0] will be created
  + resource "google_monitoring_alert_policy" "uptime-check" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "uptime check failed for data.terra.bio/"
      + enabled               = true
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "terra-datarepo-production"

      + conditions {
          + display_name = "Uptime Health Check on data.terra.bio"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = (known after apply)
              + threshold_value = 1

              + aggregations {
                  + alignment_period     = "1200s"
                  + cross_series_reducer = "REDUCE_COUNT_FALSE"
                  + group_by_fields      = [
                      + "resource.*",
                    ]
                  + per_series_aligner   = "ALIGN_NEXT_OLDER"
                }

              + trigger {
                  + count   = 1
                  + percent = 0
                }
            }
        }

      + documentation {
          + content   = "https://data.terra.bio/"
          + mime_type = "text/markdown"
        }
    }

  # module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0] will be created
  + resource "google_monitoring_uptime_check_config" "uptime-check-config" {
      + display_name     = "data.terra.bio/"
      + id               = (known after apply)
      + is_internal      = (known after apply)
      + name             = (known after apply)
      + period           = "900s"
      + project          = "terra-datarepo-production"
      + selected_regions = [
          + "ASIA_PACIFIC",
          + "EUROPE",
          + "SOUTH_AMERICA",
          + "USA",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + mask_headers   = false
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true
        }

      + internal_checkers {
          + display_name    = (known after apply)
          + gcp_zone        = (known after apply)
          + name            = (known after apply)
          + network         = (known after apply)
          + peer_project_id = (known after apply)
        }

      + monitored_resource {
          + labels = {
              + "host"       = "data.terra.bio"
              + "project_id" = "terra-datarepo-production"
            }
          + type   = "uptime_url"
        }

      + timeouts {}
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwWu0Nc/FgU="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

Plan: 10 to add, 9 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/production`*
